app/controllers/application_controller.rb

  def current_user
    user ||= User.find_by(session_token: self.session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "GVFGegsOi2-Pnb351YX1qw"], ["LIMIT", 1]]