app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    @comment.commentable_type = params[:user_id] == nil ? "Goal" : "User"
    @comment.commentable_id = params[:user_id] == nil ? params[:goal_id] : params[:user_id]
    redirect = params[:user_id] == nil

    if @comment.save
---
INSERT INTO "comments" ("body", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "hell"], ["author_id", 2], ["commentable_id", 1], ["commentable_type", "User"], ["created_at", "2019-05-24 17:12:45.402508"], ["updated_at", "2019-05-24 17:12:45.402508"]]