app/controllers/goals_controller.rb

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @goal = Goal.find(params[:id])

INSERT INTO "goals" ("title", "details", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "get stuff"], ["details", "fklndjlkf"], ["user_id", 1], ["created_at", "2019-05-23 21:45:02.513356"], ["updated_at", "2019-05-23 21:45:02.513356"]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", true], ["updated_at", "2019-05-23 21:47:53.431549"], ["id", 1]]
---
  def update
    @goal = Goal.find(params[:id])
    if @goal.user_id == current_user.id
      @goal.update(completed: !@goal.completed)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 32]]
---
  def destroy
    @goal = Goal.find(params[:id])

    if @goal.user_id == current_user.id
      @goal.destroy