app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."commentable_type" = $1 AND "comments"."commentable_id" = $2  [["commentable_type", "User"], ["commentable_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @goals = @user.goals
    @comments = Comment.where(commentable_type: "User", commentable_id: @user.id)