app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "GVFGegsOi2-Pnb351YX1qw"], ["updated_at", "2019-05-23 16:46:50.727938"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save